app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `karyawan`
SELECT COUNT(*) AS `numrows`
FROM `karyawan`
WHERE `status_kerja` = 'aktif'
SELECT COUNT(*) AS `numrows` FROM `departemen`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'karyawan'
SELECT COUNT(*) AS `numrows`
FROM `gaji`
WHERE `periode` = '2026-07'
SELECT COUNT(*) AS `numrows`
FROM `gaji`
WHERE `periode` = '2026-06'
---
    public function index()
    {
        $session = session();

        // Jika yang login adalah karyawan, redirect ke dashboard karyawan
        if ($session->get('role') == 'karyawan') {
            return redirect()->to('/karyawan/dashboard');
        }

        $karyawanModel = new KaryawanModel();
        $gajiModel = new GajiModel();
        $departemenModel = new DepartemenModel();
        $userModel = new UserModel();

        $data = [
            'title' => 'Dashboard',
            'total_karyawan' => $karyawanModel->countAll(),
            'total_karyawan_aktif' => $karyawanModel->where('status_kerja', 'aktif')->countAllResults(),
            'total_departemen' => $departemenModel->countAll(),
            'total_user_karyawan' => $userModel->where('role', 'karyawan')->countAllResults(),
            'total_gaji_periode_ini' => $gajiModel->where('periode', date('Y-m'))->countAllResults(),
            'total_gaji_periode_sebelumnya' => $gajiModel->where('periode', date('Y-m', strtotime('-1 month')))->countAllResults(),