app/Controllers/KaryawanDashboard.php

SELECT *
FROM `gaji`
WHERE `id_karyawan` = '3'
ORDER BY `periode` DESC
 LIMIT 1
SELECT SUM(`total_gaji`) AS `total`
FROM `gaji`
WHERE `id_karyawan` = '3'
SELECT COUNT(*) AS `numrows`
FROM `gaji`
WHERE `id_karyawan` = '3'
---
    public function index()
    {
        $session = session();
        $idKaryawan = $session->get('id_karyawan');

        if (! $idKaryawan) {
            return redirect()->to('/login')->with('message', 'Akun karyawan tidak terhubung.');
        }

        $karyawanModel = new KaryawanModel();
        $gajiModel = new GajiModel();

        $karyawan = $karyawanModel->getKaryawanById($idKaryawan);

        // Gaji terakhir
        $gajiTerakhir = $gajiModel->where('id_karyawan', $idKaryawan)
            ->orderBy('periode', 'DESC')
            ->first();

        // Total gaji sepanjang masa
        $totalGajiAll = $gajiModel->where('id_karyawan', $idKaryawan)
            ->selectSum('total_gaji', 'total')
            ->get()
            ->getRowArray()['total'] ?? 0;

        // Jumlah periode gaji
        $totalPeriodeGaji = $gajiModel->where('id_karyawan', $idKaryawan)->countAllResults();