app/Controllers/KaryawanGaji.php

    public function index()
    {
        $session = session();
        $idKaryawan = $session->get('id_karyawan');

        $gajiModel = new GajiModel();
        $karyawanModel = new KaryawanModel();

        $karyawan = $karyawanModel->find($idKaryawan);

        // Semua gaji karyawan ini
        $gajiList = $gajiModel->where('id_karyawan', $idKaryawan)
            ->orderBy('periode', 'DESC')
            ->findAll();
---
SELECT *
FROM `karyawan`
WHERE `karyawan`.`id` = '3'
SELECT *
FROM `gaji`
WHERE `id_karyawan` = '3'
ORDER BY `periode` DESC