app/Controllers/Karyawan.php

    public function index()
    {
        $karyawanModel = new KaryawanModel();
        $userModel = new UserModel();
        $karyawanList = $karyawanModel->getKaryawanFull();

        // Cek apakah setiap karyawan sudah punya akun
        foreach ($karyawanList as &$k) {
            $existing = $userModel->where('id_karyawan', $k['id'])->first();
---
SELECT *
FROM `users`
WHERE `id_karyawan` = '1'
 LIMIT 1