app/Models/DepartemenModel.php

    public function getDepartemenWithCount()
    {
        return $this->select('departemen.*, COUNT(karyawan.id) as jumlah_karyawan')
            ->join('karyawan', 'karyawan.id_departemen = departemen.id', 'left')
            ->groupBy('departemen.id')
            ->findAll();
---
SELECT `departemen`.*, COUNT(karyawan.id) as jumlah_karyawan
FROM `departemen`
LEFT JOIN `karyawan` ON `karyawan`.`id_departemen` = `departemen`.`id`
GROUP BY `departemen`.`id`