app/Models/GajiModel.php

    public function getGajiFull()
    {
        return $this->select('gaji.*, karyawan.nip, karyawan.nama_lengkap, departemen.nama_departemen, jabatan.nama_jabatan')
            ->join('karyawan', 'karyawan.id = gaji.id_karyawan', 'left')
            ->join('departemen', 'departemen.id = karyawan.id_departemen', 'left')
            ->join('jabatan', 'jabatan.id = karyawan.id_jabatan', 'left')
            ->orderBy('gaji.periode', 'DESC')
            ->orderBy('gaji.id', 'DESC')
            ->findAll();
---
SELECT `gaji`.*, `karyawan`.`nip`, `karyawan`.`nama_lengkap`, `departemen`.`nama_departemen`, `jabatan`.`nama_jabatan`
FROM `gaji`
LEFT JOIN `karyawan` ON `karyawan`.`id` = `gaji`.`id_karyawan`
LEFT JOIN `departemen` ON `departemen`.`id` = `karyawan`.`id_departemen`
LEFT JOIN `jabatan` ON `jabatan`.`id` = `karyawan`.`id_jabatan`
ORDER BY `gaji`.`periode` DESC, `gaji`.`id` DESC

    public function getGajiById($id)
    {
        return $this->select('gaji.*, karyawan.nip, karyawan.nama_lengkap, karyawan.no_telepon, karyawan.email,
            karyawan.no_rekening, karyawan.nama_bank, karyawan.status_pernikahan, karyawan.jumlah_tanggungan,
            departemen.nama_departemen, jabatan.nama_jabatan')
            ->join('karyawan', 'karyawan.id = gaji.id_karyawan', 'left')
            ->join('departemen', 'departemen.id = karyawan.id_departemen', 'left')
            ->join('jabatan', 'jabatan.id = karyawan.id_jabatan', 'left')
            ->where('gaji.id', $id)
            ->first();
---
SELECT `gaji`.*, `karyawan`.`nip`, `karyawan`.`nama_lengkap`, `karyawan`.`no_telepon`, `karyawan`.`email`, `karyawan`.`no_rekening`, `karyawan`.`nama_bank`, `karyawan`.`status_pernikahan`, `karyawan`.`jumlah_tanggungan`, `departemen`.`nama_departemen`, `jabatan`.`nama_jabatan`
FROM `gaji`
LEFT JOIN `karyawan` ON `karyawan`.`id` = `gaji`.`id_karyawan`
LEFT JOIN `departemen` ON `departemen`.`id` = `karyawan`.`id_departemen`
LEFT JOIN `jabatan` ON `jabatan`.`id` = `karyawan`.`id_jabatan`
WHERE `gaji`.`id` = '15'
 LIMIT 1

    public function getRekapGajiPeriode($periode)
    {
        return $this->select('
            SUM(gaji_pokok) as total_gaji_pokok,
            SUM(tunjangan_jabatan) as total_tunjangan_jabatan,
            SUM(tunjangan_makan) as total_tunjangan_makan,
            SUM(tunjangan_transport) as total_tunjangan_transport,
            SUM(tunjangan_lain) as total_tunjangan_lain,
            SUM(potongan_absen) as total_potongan_absen,
            SUM(potongan_keterlambatan) as total_potongan_keterlambatan,
            SUM(potongan_lain) as total_potongan_lain,
            SUM(potongan_pph) as total_potongan_pph,
            SUM(total_gaji) as total_gaji
        ')
            ->where('periode', $periode)
            ->first();
---
SELECT SUM(gaji_pokok) as total_gaji_pokok, SUM(tunjangan_jabatan) as total_tunjangan_jabatan, SUM(tunjangan_makan) as total_tunjangan_makan, SUM(tunjangan_transport) as total_tunjangan_transport, SUM(tunjangan_lain) as total_tunjangan_lain, SUM(potongan_absen) as total_potongan_absen, SUM(potongan_keterlambatan) as total_potongan_keterlambatan, SUM(potongan_lain) as total_potongan_lain, SUM(potongan_pph) as total_potongan_pph, SUM(total_gaji) as total_gaji
FROM `gaji`
WHERE `periode` = '2026-07'
 LIMIT 1