app/Models/JabatanModel.php

SELECT `jabatan`.*, `departemen`.`nama_departemen`
FROM `jabatan`
LEFT JOIN `departemen` ON `departemen`.`id` = `jabatan`.`id_departemen`
---
    public function getJabatanWithDepartemen()
    {
        return $this->select('jabatan.*, departemen.nama_departemen')
            ->join('departemen', 'departemen.id = jabatan.id_departemen', 'left')
            ->findAll();