app/Models/KaryawanModel.php

SELECT `karyawan`.*, `departemen`.`nama_departemen`, `jabatan`.`nama_jabatan`
FROM `karyawan`
LEFT JOIN `departemen` ON `departemen`.`id` = `karyawan`.`id_departemen`
LEFT JOIN `jabatan` ON `jabatan`.`id` = `karyawan`.`id_jabatan`
---
    public function getKaryawanFull()
    {
        return $this->select('karyawan.*, departemen.nama_departemen, jabatan.nama_jabatan')
            ->join('departemen', 'departemen.id = karyawan.id_departemen', 'left')
            ->join('jabatan', 'jabatan.id = karyawan.id_jabatan', 'left')
            ->findAll();

SELECT `karyawan`.*, `departemen`.`nama_departemen`, `jabatan`.`nama_jabatan`, `jabatan`.`gaji_pokok`, `jabatan`.`tunjangan_jabatan`
FROM `karyawan`
LEFT JOIN `departemen` ON `departemen`.`id` = `karyawan`.`id_departemen`
LEFT JOIN `jabatan` ON `jabatan`.`id` = `karyawan`.`id_jabatan`
WHERE `karyawan`.`id` = '3'
 LIMIT 1
---
    public function getKaryawanById($id)
    {
        return $this->select('karyawan.*, departemen.nama_departemen, jabatan.nama_jabatan, jabatan.gaji_pokok, jabatan.tunjangan_jabatan')
            ->join('departemen', 'departemen.id = karyawan.id_departemen', 'left')
            ->join('jabatan', 'jabatan.id = karyawan.id_jabatan', 'left')
            ->where('karyawan.id', $id)
            ->first();